package Lesson8;

public class Task {
    /*
    В качестве опционального задания предлагается реализовать конвертер температур.
    Пользователь вводит необходимое количество градусов, например в Цельсиях.
    Далее предлагается выбрать в какую систему данные градусы необходимо перевести и после чего выводится результат.
    Среди многообразия температур предлагаю выделить Цельсии, Кельвины и Фаренгейты,
    которые следует хранить в виде констант перечислений.
    Требуемые конвертеры необходимо реализовать, полагаясь на интерфейсы.
     */
}
