package Lesson7;

public class Task {
    /*
    Для выполнения задания необходимо пройти три этапа:

1. Создать три класса Человек, Кот, Робот, которые не наследуются от одного класса.
Эти классы должны уметь бегать и прыгать, все также с выводом информации о действии в консоль.

2. Создать два класса: беговая дорожка и стена, при прохождении через которые,
участники должны выполнять соответствующие действия (бежать или прыгать),
результат выполнения печатаем в консоль (успешно пробежал, не смог пробежать и т.д.).

У препятствий есть длина (для дорожки) или высота (для стены), а участников ограничения на бег и прыжки.

3. Создать два массива: с участниками и препятствиями, и заставить всех участников пройти этот набор препятствий.
 Если участник не смог пройти одно из препятствий, то дальше по списку препятствий он не идет.
     */
}
